<?php

namespace App\Http\Controllers;
use Inertia\Inertia;
use Illuminate\Http\Request;


class ProductController extends Controller
{

    private $products = [
        ['id' => 1, 'name' => 'กระเป๋าสะพายไหล่ POLA M',
            'description' => 'กระเป๋า Pola Shoulder M กระเป๋าดีไซน์หรูหราที่จะช่วยคอมพลีตลุคของสาวลินให้สมบูรณ์ ไอเทมที่สามารถนำมาหยิบใช้ได้หลากหลายโอกาสตั้งแต่วันทำงานไปจนถึงเดทไนท์หรูหรา มาพร้อมรายละเอียดกระเป๋าทรงครึ่งวงกลม ซิปเปิดกระเป๋าด้านบนพร้อมสายคาดกระเป๋าแม่เหล็ก หูหิ้วกระเป๋าถอดปรับได้ โลโก้ประดับด้านหน้า ช่องเก็บสัมภาระและสายสะพายกระเป๋ายาวถอดปรับได้',
            'price' => 2790,
            'image' => 'https://www.lynaccs.com/cdn/shop/files/LL24CBS383_PNK100_1_354473af-eaa1-496a-873f-9ff2c37c5514.jpg?v=1728369118&width=1200' ],

        ['id' => 2, 'name' => 'กระเป๋าทรงถัง ROSLYN 24',
            'description' => 'กระเป๋า Roslyn 24 Bucket กระเป๋าดีไซน์คลาสสิคเหมาะสมกับการใช้งานทุกรูปแบบ ไอเทมชิ้นสำคัญที่จะช่วยคอมพลีทลุคของสาวลินให้โดดเด่นน่าจับตามอง ไอเทมไอคอนิคใบใหม่จากคอลเลคชั่นล่าสุดที่ผสมผสานนำเอาดีไซน์ของความแคชชวลเข้ากับฟังก์ชั่นการใช้งานครบครัน มาพร้อมกับรายละเอียดกระเป๋าทรงถัง ปากกระเป๋าเชือกรูด ช่องเก็บสัมภาระกว้าง ช่องกระเป๋าด้านหน้า โลโก้โลหะประดับด้านหน้า หูหิ้วกระเป๋าและสายกระเป๋ายาวถอดปรับได้',
            'price' => 2890,
            'image' => 'https://www.lynaccs.com/cdn/shop/files/LL24CBF354_BLK000_1_78e3be50-d15f-4262-bf1b-eb14fcaa2ca1.jpg?v=1722497343&width=1400' ],

        ['id' => 3, 'name' => 'กระเป๋าโท้ท POLARIS S',
            'description' => 'กระเป๋า Polaris ทรง Tote bag พร้อมสายคล้องยาว ตกแต่งฝากระเป๋าปิดเปิดด้านหน้า ประทับโลโก้แบรนด์ วัสดุทนทาน',
            'price' => 3190,
            'image' => 'https://www.lynaccs.com/cdn/shop/files/LL24FBS151_WHT600_1_51dccacc-8e14-4772-84f4-3efd960c5e44.jpg?v=1728371611&width=1400' ],

        ['id' => 4, 'name' => 'กระเป๋าสตางค์มีโซ่ EMMA CLUCTH WITH CHAIN',
            'description' => 'กระเป๋า Emma Clutch With Chain กระเป๋าทรงคลาสสิกใช้งานง่ายสำหรับวาระโอกาสวันแคชชวลสุดชิล หรือวันเข้าออฟฟิศที่ต้องการความฟอร์มอล โดดเด่นด้วยการออกแบบที่สวยงาม และฟังก์ชั่นการใช้งานครบครัน พร้อมยกระดับสไตล์ทางแฟชั่นอันโดดเด่นให้กับผู้ใช้งาน มาพร้อมรายละเอียดทรงกระเป๋าสี่เหลี่ยม ฝาพับกระเป๋าแม่เหล็กเปิดปิด ดีเทลลายบุตารางทั่วตัวกระเป๋า โลโก้แบรนด์ฮาร์ดแวร์โลหะโทนสีทองประดับบริเวณตัวกระเป๋า ช่องเก็บสัมภาระ และสายกระเป๋ายาวที่สะพายสะพายขึ้นไหล่ หรือนำมาสไตล์ลิ่งเป็นกระเป๋าครอสบอดี้',
            'price' => 2990,
            'image' => 'https://www.lynaccs.com/cdn/shop/files/LL24FBF097_BEG000_1_cd4d23d8-58bc-49a5-97ec-85804fcab6ff.jpg?v=1722497691&width=1400' ],

        ['id' => 5, 'name' => 'กระเป๋าสะพายไหล่ STEVIE INFINITE',
            'description' => 'กระเป๋า Stevie Infinite Shoulder ไอเทมดีไซน์น่ารักใบใหม่ล่าสุดที่ชวนให้ตกหลุมรักในแรกพบ สามารถหยิบนำมาใช้ได้ในชีวิตประจำวันทั้งในช่วงเวลาเช้า และกลางคืน ไอเทมชิ้นเด่นประจำฤดูกาลที่สาวลินพลาดไม่ได้ มาพร้อมรายละเอียดทรงกระเป๋าสี่เหลี่ยม ฝาพับกระเป๋าแม่เหล็กเปิดปิด แพทเทิร์นฉลุลายอินฟินิท โลโก้ประดับด้านหน้า ช่องเก็บสัมภาระ และหูหิ้วกระเป๋าสำหรับสะพายไหล่',
            'price' => 3390,
            'image' => 'https://www.lynaccs.com/cdn/shop/files/LL24MBF321_BLU800_1_c3fbeb87-405a-47d1-b5df-c33aaf2b1517.jpg?v=1728375983&width=1400' ],

        ['id' => 6, 'name' => 'กระเป๋าสะพายไหล่ STEVIE INFINITE S',
            'description' => 'กระเป๋า Stevie Infinite Shoulder S ไอเทมดีไซน์น่ารักใบใหม่ล่าสุดที่ชวนให้ตกหลุมรักในแรกพบ สามารถหยิบนำมาใช้ได้ในชีวิตประจำวันทั้งในช่วงเวลาเช้า และกลางคืน ไอเทมชิ้นเด่นประจำฤดูกาลที่สาวลินพลาดไม่ได้ มาพร้อมรายละเอียดทรงกระเป๋าครึ่งวงกลม ซิปเปิดปิดกระเป๋า ลายพิมพ์แพทเทิร์นอินฟินิท โลโก้ประดับด้านหน้า ช่องเก็บสัมภาระ และสายกระเป๋ายาวปรับระดับได้',
            'price' => 2790,
            'image' => 'https://www.lynaccs.com/cdn/shop/files/LL24MBF320_WHT600_1_6735f8a4-c507-4bc2-bb8a-4a5b98f3af75.jpg?v=1728375708&width=1400' ],

            ['id' => 7, 'name' => 'กระเป๋าถือ ROSLYN QUILTED',
            'description' => 'กระเป๋า Roslyn Quilted Top Handle กระเป๋าสไตล์แคชชวลสุดน่ารักที่จะช่วยเผยตัวตนของสาวลินให้โดดเด่น เพื่อนซี้ไซซ์กะทัดรัดที่สามารถหยิบนำไปมิกซ์แอนด์แมทช์กับเสื้อผ้าได้หลากหลายไอเทม มาพร้อมรายละเอียดทรงกระเป๋าสี่เหลี่ยม ซิปรูดเปิดปิดกระเป๋า พื้นผิวกระเป๋านุ่ม ลายบุตารางทั่วตัวกระเป๋า หูหิ้วกระเป๋า ช่องเก็บสัมภาระ โลโก้ประดับด้านหน้า ชาร์มห้อยกระเป๋า สายสะพายกระเป๋ายาวถอดปรับได้',
            'price' => 2385,
            'image' => 'https://www.lynaccs.com/cdn/shop/files/LL24CBF351_GRN000_1_74f0fac3-4f88-4333-aabd-ca4df0279e97.jpg?v=1722497341&width=1400' ],

        ['id' => 8, 'name' => 'กระเป๋าสะพายข้าง JOANN',
            'description' => 'กระเป๋า Joann Crossbody ไอเทมไซส์เล็กที่โดดเด่นการใช้งานหลากหลายฟังก์ชั่น รูปทรงกระทัดรัดช่วยคอมพลีทลุคแฟชั่นในวันทำงาน หรือวันแคชชวลสุดชิล มาพร้อมรายละเอียดทรงกระเป๋าสี่เหลี่ยม ซิปรูดเปิดปิดกระเป๋า โลโก้ประดับ ช่องกระเป๋าด้านหน้า หูหิ้วกระเป๋า ลายบุตารางทั่วตัวกระเป๋า ช่องเก็บสัมภาระขนาดใหญ่ และสายกระเป๋ายาวถอดปรับได้ที่สามารถสไตล์ลิ่งเป็นกระเป๋าครอสบอดี้ หรือกระเป๋าสะพายข้าง',
            'price' => 3599,
            'image' => 'https://www.lynaccs.com/cdn/shop/files/LL24CBF331_PPL000_1_7fdf5bb7-2de4-4388-93d0-63af8ba1087a.jpg?v=1733119477&width=1400' ],

        ['id' => 9, 'name' => 'กระเป๋าถือ MAILA',
            'description' => 'กระเป๋า Maila Handle Bag ดีไซน์ของความอ่อนหวานและความน่ารักที่ถูกนำมาประยุกต์ใช้กับการออกแบบกระเป๋ารุ่นล่าสุด ไอเทมที่พร้อมจะช่วยคอมพลีทลุคของคุณให้โดดเด่นน่าจับตามอง ทรวดทรงกระเป๋าทะมัดทะแมงพร้อมจะพาผู้หญิงลินทุกคนออกเผชิญกับอุปสรรอันน่าตื่นเต้นในเมืองใหญ๋ทั้งยังช่วยมอบสไตล์ทางแฟชั่นสุดไอคอนิคให้กับผู้ใช้งาน มาพร้อมรายละเอียดกระเป๋าทรงสี่เหลี่ยม ซิปรูดกระเป๋าเปิดปิดพร้อมโลโก้ประดับด้านหน้า หูหิ้วกระเป๋า ช่องเก็บสัมภาระด้านหน้า ช่องเก็บสัมภาระแยก ลายบุตารางทั่วตัวกระเป๋า หูหิ้วกระเป๋าและสายสะพายยาวถอดปรับได้',
            'price' => 2396,
            'image' => 'https://www.lynaccs.com/cdn/shop/files/LL24CBF350_RED000_1_8a3aac5d-0e34-42bf-ba93-60f066ea555f.jpg?v=1728364813&width=1400' ],

        ['id' => 10, 'name' => 'กระเป๋าสะพายข้าง EUGIN INFINITE MINI CROSS',
            'description' => 'กระเป๋าโท้ท Euginie Infinite Mini Crossbody ดีไซน์กระเป๋าใช้งานง่ายที่สามารถจุสัมภาระได้เพียงพอต่อการใช้งานในทุกวัน ดีไซน์ใช้งานง่ายที่สามารถจุนำไปมิกซ์แอนด์แมทช์กับเสื้อผ้าของคุณได้หลากหลายลุค มาพร้อมรายละเอียดทรงกระเป๋าสี่เหลี่ยม ฝาพับกระเป๋าแม่เหล็กเปิดปิด หูหิ้วกระเป๋า ลายปักโลโก้อินฟินิตประดับด้านหน้า ช่องเก็บสัมภาระขนาดใหญ่ และสายสะพายยาวถอดปรับได้ที่สามารถสไตล์ลิ่งเป็นกระเป๋าสะพายข้าง หรือกระเป๋าครอสบอดี้',
            'price' => 2590,
            'image' => 'https://www.lynaccs.com/cdn/shop/files/LL24MBF319_GRN000_1_2fb7cb97-6e29-4614-941c-99daa5fc63c4.jpg?v=1728379591&width=1400' ],

        ['id' => 11, 'name' => 'กระเป๋าสะพายไหล่ RE-EDIT RAY ATELLA',
            'description' => 'กระเป๋าสะพายไหล่ Re-Edit Ray Atella Shoulder ไอเทมใบใหม่ล่าสุดจากคอลเลคชั่นประจำฤดูกาลที่พร้อมจะช่วยดูแลสัมภาระของคุณให้ปลอดภัย ดีไซน์สุดทันสมัยผสมผสานความกระชับกระฉับกระเฉงที่ได้แรงบันดาลใจจากตัวตนของผู้หญิงสมัยใหม่ เปี่ยมด้วยความมั่นใจ พร้อมเผชิญความท้าทายทุกรูปแบบ มาพร้อมรายละเอียดกระเป๋าทรงสี่เหลี่ยม ซูปรูดเปิดปิดด้านบนพร้อมสายคาดแม่เหล็กเปิดปิด โลโก้แบรนด์ด้านหน้า หูหิ้วกระเป๋า สายสะพายไหล่แบบปรับถอดได้ ช่องเก็บสัมภาระด้านในกว้างจุสัมภาระได้ตามต้องการ มีให้เลือก 4 สี สีดำ สีขาวงาช้าง สีชมพู และสีฟ้า',
            'price' => 2649,
            'image' => 'https://www.lynaccs.com/cdn/shop/files/LL24CBS191_PNK000_1_20fbe8d9-a7ba-4457-b829-8c6d1130668f.jpg?v=1728377587&width=2400' ],

        ['id' => 12, 'name' => 'กระเป๋าโท้ท DEROLA TOTE S',
            'description' => 'ยกระดับความสง่างามด้วยกระเป๋าถือ ที่เก๋ไก๋ มาพร้อมหูจับหนังสุดหรูและสายสะพายถอดปรับได้เพื่อความสะดวกสบาย ผ้าตาข่ายที่ประดับด้วยการปักลวดลายดอกไม้และขอบปากกระเป๋าที่เป็นคลื่นเพิ่มความโดดเด่น การปิดด้วยตัวล็อคแม่เหล็กช่วยให้สิ่งของของคุณปลอดภัย ประดับโลโก้แบรนด์ลิน',
            'price' => 2669,
            'image' => 'https://www.lynaccs.com/cdn/shop/files/LL24FBF235_BEG000_2_dffe438a-5fca-4629-9c9b-78a9cc386d2d.jpg?v=1728385266&width=2400' ],


    ];

    /**
     * Display a listing of the resource.
     */
    public function index()
    {
        //
        return Inertia::render('Products/Index', ['products' => $this->products]);
    }

    /**
     * Show the form for creating a new resource.
     */
    public function create()
    {
        //
    }

    /**
     * Store a newly created resource in storage.
     */
    public function store(Request $request)
    {
        //
    }

    /**
     * Display the specified resource.
     */
    public function show(string $id)
    {
        //
        $product = collect($this->products)->firstWhere('id', $id);

        if (!$product) {
            abort(404, 'Product not found');
        }

        return Inertia::render('Products/Show', ['product' => $product]);
    }

    /**
     * Show the form for editing the specified resource.
     */
    public function edit(string $id)
    {
        //
    }

    /**
     * Update the specified resource in storage.
     */
    public function update(Request $request, string $id)
    {
        //
    }

    /**
     * Remove the specified resource from storage.
     */
    public function destroy(string $id)
    {
        //
    }
}
